In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("Toyota.csv")
print(df)

      Unnamed: 0  Price   Age     KM FuelType   HP  MetColor  Automatic    CC  \
0              0  13500  23.0  46986   Diesel   90       1.0          0  2000
1              1  13750  23.0  72937   Diesel   90       1.0          0  2000
2              2  13950  24.0  41711   Diesel   90       NaN          0  2000
3              3  14950  26.0  48000   Diesel   90       0.0          0  2000
4              4  13750  30.0  38500   Diesel   90       0.0          0  2000
...          ...    ...   ...    ...      ...  ...       ...        ...   ...
1431        1431   7500   NaN  20544   Petrol   86       1.0          0  1300
1432        1432  10845  72.0     ??   Petrol   86       0.0          0  1300
1433        1433   8500   NaN  17016   Petrol   86       0.0          0  1300
1434        1434   7250  70.0     ??      NaN   86       1.0          0  1300
1435        1435   6950  76.0      1   Petrol  110       0.0          0  1600

      Doors  Weight
0     three    1165
1         3    1165
2         3    1165
3         3    1165
4         3    1170
...     ...     ...
1431      3    1025
1432      3    1015
1433      3    1015
1434      3    1015
1435      5    1114

[1436 rows x 11 columns]

### As we can see there are two indexing in dataframe one from dataset name as unnamed and one will provided by the pandas dataframe.
### as we use index_col = 0 in read function it will remove one indexing from dataset name as unnamed.

In [2]:
df = pd.read_csv('Toyota.csv', index_col = 0)
print(df)

      Price   Age     KM FuelType   HP  MetColor  Automatic    CC  Doors  \
0     13500  23.0  46986   Diesel   90       1.0          0  2000  three
1     13750  23.0  72937   Diesel   90       1.0          0  2000      3
2     13950  24.0  41711   Diesel   90       NaN          0  2000      3
3     14950  26.0  48000   Diesel   90       0.0          0  2000      3
4     13750  30.0  38500   Diesel   90       0.0          0  2000      3
...     ...   ...    ...      ...  ...       ...        ...   ...    ...
1431   7500   NaN  20544   Petrol   86       1.0          0  1300      3
1432  10845  72.0     ??   Petrol   86       0.0          0  1300      3
1433   8500   NaN  17016   Petrol   86       0.0          0  1300      3
1434   7250  70.0     ??      NaN   86       1.0          0  1300      3
1435   6950  76.0      1   Petrol  110       0.0          0  1600      5

      Weight
0       1165
1       1165
2       1165
3       1165
4       1170
...      ...
1431    1025
1432    1015
1433    1015
1434    1015
1435    1114

[1436 rows x 10 columns]

### How to create Copy of Original Dataset

--> There are two ways of copying the original data
1. shallow copy
2. deep copy

### Shallow Copy

A shallow copy, as the name suggests, creates a new DataFrame object that references the original data. In other words, a shallow copy points to the same memory location as the original DataFrame. Any modifications made to the shallow copy will reflect in the original DataFrame and vice versa. This behaviour is due to the shared references between the original and the copied object.

Syntax:->
pandas.DataFrame.copy(deep=False)

If 'deep=False', a shallow copy of the DataFrame is created but the data and index labels are not copied, instead, both the original and the new DataFrame will refer the same data and index labels. 

#### shallow copy:-> dataset is same, and  shallow copy is same but memory locations are different, if we make change anything in shallow copy function and it will also reflect in original dataset or in dataframe, and if we make change in dataframe it will also reflect in shallow data because they are refrencing the same data only.

In [3]:
# Shallow Copy

sample = df.copy(deep = False)
print(sample)

      Price   Age     KM FuelType   HP  MetColor  Automatic    CC  Doors  \
0     13500  23.0  46986   Diesel   90       1.0          0  2000  three
1     13750  23.0  72937   Diesel   90       1.0          0  2000      3
2     13950  24.0  41711   Diesel   90       NaN          0  2000      3
3     14950  26.0  48000   Diesel   90       0.0          0  2000      3
4     13750  30.0  38500   Diesel   90       0.0          0  2000      3
...     ...   ...    ...      ...  ...       ...        ...   ...    ...
1431   7500   NaN  20544   Petrol   86       1.0          0  1300      3
1432  10845  72.0     ??   Petrol   86       0.0          0  1300      3
1433   8500   NaN  17016   Petrol   86       0.0          0  1300      3
1434   7250  70.0     ??      NaN   86       1.0          0  1300      3
1435   6950  76.0      1   Petrol  110       0.0          0  1600      5

      Weight
0       1165
1       1165
2       1165
3       1165
4       1170
...      ...
1431    1025
1432    1015
1433    1015
1434    1015
1435    1114

[1436 rows x 10 columns]

### Deep Copy
A deep copy refers to developing a very independent copy of a dataframe, which includes all its data and metadata. In other phrases, a deep copy creates a brand new dataframe object with its personal memory space, become independent from the original dataframe.

### Syntax
pandas.DataFrame.copy(deep=True)

The parameter “deep”: is optional and its default value is set to True. If 'deep=True', a deep copy of the DataFrame is created. So, we infer that a new DataFrame object is created and all the data and index labels are copied from the original DataFrame to the new one. 

--> Deep copy: Here, deep copy makes the dataset different and original dataset.now, it's original copy means if we make any change to deep copy or in orginal dataframe they can't show in each other. and it store in different memory location.

In [4]:
# Deep Copy

sample1 = df.copy(deep = True)
print(sample1)

      Price   Age     KM FuelType   HP  MetColor  Automatic    CC  Doors  \
0     13500  23.0  46986   Diesel   90       1.0          0  2000  three
1     13750  23.0  72937   Diesel   90       1.0          0  2000      3
2     13950  24.0  41711   Diesel   90       NaN          0  2000      3
3     14950  26.0  48000   Diesel   90       0.0          0  2000      3
4     13750  30.0  38500   Diesel   90       0.0          0  2000      3
...     ...   ...    ...      ...  ...       ...        ...   ...    ...
1431   7500   NaN  20544   Petrol   86       1.0          0  1300      3
1432  10845  72.0     ??   Petrol   86       0.0          0  1300      3
1433   8500   NaN  17016   Petrol   86       0.0          0  1300      3
1434   7250  70.0     ??      NaN   86       1.0          0  1300      3
1435   6950  76.0      1   Petrol  110       0.0          0  1600      5

      Weight
0       1165
1       1165
2       1165
3       1165
4       1170
...      ...
1431    1025
1432    1015
1433    1015
1434    1015
1435    1114

[1436 rows x 10 columns]

## Attributes of 

Means what are the attributes that most commonly used

In [5]:
# .DataFrame.index - To get the index(row labels) of the dataframe.

x = df.index
print(x)

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [6]:
# .DataFrame.columns - To get the column labels of the dataframe. columns are also called as variable

df.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [7]:
# .DataFrame.size - To get the total number of elements from the dataframe
# Total no. of elements - 14360

df.size

14360

In [8]:
# .DataFrame.shape - To get to dimensionality of the dataframe
# Total No's of Rows and Columns

df.shape

(1436, 10)

In [9]:
# DataFrame.memory_usage([index,depp]) --> how much memory used by each column.

df.memory_usage([x, sample1])

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [10]:
# DataFrame.ndim - The number of axes / array dimensions  --> For Checking the Dimensions

df.ndim

2

# Indexing and Selecting Data

In [11]:
# DataFrame.head([n]) - The function head returns the first n rows from the dataframe.
# Bydefault if we don't putanything in head then it will give you Top 5 rows.

df.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [12]:
# It's opposite of head it will return bydefault last 5 rows

df.tail()

## Head and Tail is used for quickly verifying the data.

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

Accessing a Scalar value, Accessing these were for seeing a sample data after appending rows or sorting now
when you have to access the data so the fastest way to access the data a scalar value you can say is at,iat method

In [13]:
# at -> provides label-based scalar loopups

# syntax -> dataframe.at[row(in which row you want to look up your data), 'Just give the name of column'
# (that we want to see the part that particular data from second row)]

df.at[2, 'Doors']

'3'

In [14]:
# iat -> provides integer-based loopups

#syntax -> dataframe.iat[row, integer value of column]

df.iat[5,8]

'3'

In [15]:
# .Loc[] -> To access a group of rows and columns by label(s) .Loc[] can be used
# in loc we can use or access the group of rows and group of columns.

df.loc[0:5, 'FuelType']

0    Diesel
1    Diesel
2    Diesel
3    Diesel
4    Diesel
5    Diesel
Name: FuelType, dtype: object

In [16]:
# dataframe.loc[Group of rows(0:2), Group of columns(fueltype:doors)]

df.loc[0:8, 'FuelType':'Doors']

  FuelType    HP  MetColor  Automatic    CC  Doors
0   Diesel    90       1.0          0  2000  three
1   Diesel    90       1.0          0  2000      3
2   Diesel    90       NaN          0  2000      3
3   Diesel    90       0.0          0  2000      3
4   Diesel    90       0.0          0  2000      3
5   Diesel    90       0.0          0  2000      3
6   Diesel  ????       NaN          0  2000      3
7      NaN    90       1.0          0  2000      3
8   Petrol   192       0.0          0  1800      3

# Data Types

<ul>
    <li> The way information gets stored in a dataframe or a python object affects the analysis and outputs of calculations.</li>
    <li> There are two main types of data.</li>
    <ul type = "circle"><li>Numeric and Character</li></ul>
    <li> Numeric data types includes integers and floats</li>
    <ul type = "circle"><li>For example: integer - 10, float - 10.53</li></ul>
    <li> Strings are known as objects in pandas which can store values that contain numbers or characters</li>
    <ul type = "circle"><li>For example:'hello1'</li></ul>
</ul>

# Numeric Types
<li>Pandas and base python uses different names for data tpes</li>
<table>
    <th>Python data type</th>
    <th>Pandas data type</th>
    <th>Description</th>
    <tr>
        <td>int</td>
        <td>int64</td>
            <td>Numeric Characters</td>
    </tr>
    <tr>
        <td>float</td>
        <td>float64</td>
            <td>Numeric characters with decimals </td>
    </tr>
</table>
'64' simply refers to the memory allocated to store data in each cell which effectively relates to how many digits it can store in each "cell" <br>
64 bits is equivalent to 8 bytes <br>
Allocating space ahead of time allows computers to optimize strong and processing efficiency

# Character Types
<li> Difference between category & object</li>
<table>
    <th>Category</th>
    <th>Object</th>
    <tr>
        <td> A string variable consisting of only a few different values.Converting such a string variable to a   categorical varibale will save some memory.</td>
        <td> The column will be assigned as object data type when it has mixed types(numbers and strings).If a column contains 'nan'(blank cells), pandas will default to object datatype.</td>
    </tr>
    <tr>
        <td> A categorical variable takes on a limited,fixed number of possible values.</td>
        <td> For strings, the length is not fixed.</td>
    </tr>
</table>

# Checking data types of each column
<b>dtypes</b> returns a series with the data type of each column <br>
<b>Syntax:</b> DataFrame.dtypes

In [17]:
df.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

# Count of unique data types
<b>.dtypes.value_counts()</b> returns counts of unique data types in the dataframe <br>
<b>Syntax:</b> DataFrame.dtypes.value_counts()<br>
<b>How many int64 are there, how many Hp is there...<b>

In [18]:
df.dtypes.value_counts()

int64      4
object     4
float64    2
Name: count, dtype: int64

# Selecting data based on data types
<b> pandas.DataFrame.select_dtypes() returns a subset of the columns from dataframe based on the column dtypes.<b> <br>
<b> Syntax: DataFrame.select_dtypes(include=None,exclude=None)</b>

In [19]:
df.select_dtypes(include=[int])

      Price  Automatic    CC  Weight
0     13500          0  2000    1165
1     13750          0  2000    1165
2     13950          0  2000    1165
3     14950          0  2000    1165
4     13750          0  2000    1170
...     ...        ...   ...     ...
1431   7500          0  1300    1025
1432  10845          0  1300    1015
1433   8500          0  1300    1015
1434   7250          0  1300    1015
1435   6950          0  1600    1114

[1436 rows x 4 columns]

In [20]:
df.select_dtypes(include = [int,float])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [21]:
df.select_dtypes(exclude=[int])

       Age     KM FuelType   HP  MetColor  Doors
0     23.0  46986   Diesel   90       1.0  three
1     23.0  72937   Diesel   90       1.0      3
2     24.0  41711   Diesel   90       NaN      3
3     26.0  48000   Diesel   90       0.0      3
4     30.0  38500   Diesel   90       0.0      3
...    ...    ...      ...  ...       ...    ...
1431   NaN  20544   Petrol   86       1.0      3
1432  72.0     ??   Petrol   86       0.0      3
1433   NaN  17016   Petrol   86       0.0      3
1434  70.0     ??      NaN   86       1.0      3
1435  76.0      1   Petrol  110       0.0      5

[1436 rows x 6 columns]

In [22]:
df.select_dtypes(exclude=[object, int])

       Age  MetColor
0     23.0       1.0
1     23.0       1.0
2     24.0       NaN
3     26.0       0.0
4     30.0       0.0
...    ...       ...
1431   NaN       1.0
1432  72.0       0.0
1433   NaN       0.0
1434  70.0       1.0
1435  76.0       0.0

[1436 rows x 2 columns]

# Concise summary of dataframe
<b>info()</b> returns a concise summary of a dataframe <br>
<li>data type of index</li>
<li>data type of columns</li>
<li>count of non-null values</li>
<li>memory usage</li>
<b>Syntax: </b> DataFrame.info()

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

# Checking the format of each column
By using info(), we can see
<li> 'KM' has been read as object instead of integer</li>
<li> 'HP' has been read as object instead of integer</li>
<li> 'Doors' should have been read as int64 since it has values 2,3,4,5.But it has been read as object</li>
<li> Missing values present in few variables</li>

# Unique elements of columns

<b> Unique(): is used to find the unique elements of a column </b> <br>
<b> Syntax: numpy.unique(array) </b> <br>
<b> This method not gonna take whole dataframe, it just take a array </b>

In [24]:
import numpy as np
print(np.unique(df["KM"]))

## This KM read as object instead of int64 because in our "KM" column we have special character as "??", 
## so we double question mark in our column that's why it is read as object type and same explanation goes for other columns

['1' '10000' '100123' ... '99865' '99971' '??']

In [25]:
print(np.unique(df["HP"]))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [26]:
print(np.unique(df["Doors"]))
## In doors we have string values that's why this is read as object type instead of int64.

['2' '3' '4' '5' 'five' 'four' 'three']

# Importing data

# Concise Summary of dataframe

In [27]:
import pandas as pd 
import numpy as np
df = pd.read_csv('Toyota.csv', index_col = 0)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB
None

In [28]:
df = pd.read_csv("Toyota.csv", index_col = 0, na_values = ['??', '????'])
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB
None

# Converting Variable's data types
<b>astype()</b> method is used to explicitly convert data types from one to another. <br>
<b>Syntax: </b> DataFrame.astype(dtype)

<b> How to convert columns data type, variable refers in dataframe as the columns. <b>

In [29]:
# we are converting metcolor datatype int64 into object datatype
# the changes should reflect on that column only.

df['MetColor'] = df['MetColor'].astype('object')
df['Automatic'] = df['Automatic'].astype('object')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

# Category VS Object Data Type
<b>nbytes()</b> is used to get the total bytes consumed by the elements of the columns <br>
<b>Syntax:</b> ndarray.nbytes <br>
This is not a method but attritbute

In [31]:
df['FuelType'].nbytes

11488

In [32]:
df['FuelType'].astype('category').nbytes

1460

# Re-Checking the data type of variables

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

# Cleaning columns 'Doors'
<b>Replace()</b> is used to replace a value with the desired value. <br>
<b>Syntax:</b> DataFrame.replace([to_replace,value]) <br>
<b>to_replace-> means that value we want to replace, and the value - means we want to replace</b> <br>
<b>df['']->this is for accessing the column</b> <br>
<b>Inplace = True </b> Will allow us to reflect the changes in our desired selected column.

In [34]:
df['Doors'].replace('three', 3, inplace=True)
df['Doors'].replace('four', 4, inplace=True)
df['Doors'].replace('five', 5, inplace=True)

/tmp/ipykernel_7046/436973468.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Doors'].replace('three', 3, inplace=True)
/tmp/ipykernel_7046/436973468.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Doors'].replace('four', 4, inplace=True)
/tmp/ipykernel_7046/436973468.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Doors'].replace('five', 5, inplace=True)

In [35]:
# Alternate option
# df['Doors'] = df['Doors'].replace({'three': 3, 'four': 4, 'five': 5})

# Converting 'Doors' data type

In [36]:
df['Doors'] = df['Doors'].astype('int64')

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB

# To detect the missing values

TO check the count of missing values present in each column <b>DataFrame.isnull.sum()</b> is used

In [38]:
df.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64